In [1]:
import os
import numpy as np
import pandas as pd

In [2]:
train=pd.read_table( os.path.join('train.csv')  ,sep=',' )

In [3]:
pd.DataFrame.head(train)

,first_active_month,card_id,feature_1,feature_2,feature_3,target
0,2017-06,C_ID_92a2005557,5,2,1,-0.820283
1,2017-01,C_ID_3d0044924f,4,1,0,0.392913
2,2016-08,C_ID_d639edf6cd,2,2,0,0.688056
3,2017-09,C_ID_186d6a6901,4,3,0,0.142495
4,2017-11,C_ID_cdbd2c0db2,1,3,0,-0.159749

In [11]:
test=pd.read_table( os.path.join('test.csv')  ,sep=',' )

In [14]:
pd.DataFrame.head(train.loc[:, train.columns != 'target'])

  first_active_month          card_id  feature_1  feature_2  feature_3
0            2017-06  C_ID_92a2005557          5          2          1
1            2017-01  C_ID_3d0044924f          4          1          0
2            2016-08  C_ID_d639edf6cd          2          2          0
3            2017-09  C_ID_186d6a6901          4          3          0
4            2017-11  C_ID_cdbd2c0db2          1          3          0

In [15]:
pd.DataFrame.head(train.loc[:, train.columns == 'target'])

     target
0 -0.820283
1  0.392913
2  0.688056
3  0.142495
4 -0.159749

In [12]:
pd.DataFrame.head(test)

  first_active_month          card_id  feature_1  feature_2  feature_3
0            2017-04  C_ID_0ab67a22ab          3          3          1
1            2017-01  C_ID_130fd0cbdd          2          3          0
2            2017-08  C_ID_b709037bc5          5          1          1
3            2017-12  C_ID_d27d835a9f          2          1          0
4            2015-12  C_ID_2b5e3df5c2          5          1          1

In [4]:
historical_transactions=pd.read_table( os.path.join('historical_transactions.csv')  ,sep=',' )

In [5]:
pd.DataFrame.head(historical_transactions)

,authorized_flag,card_id,city_id,category_1,installments,category_3,merchant_category_id,merchant_id,month_lag,purchase_amount,purchase_date,category_2,state_id,subsector_id
0,Y,C_ID_4e6213e9bc,88,N,0,A,80,M_ID_e020e9b302,-8,-0.703331,2017-06-25 15:33:07,1.0,16,37
1,Y,C_ID_4e6213e9bc,88,N,0,A,367,M_ID_86ec983688,-7,-0.733128,2017-07-15 12:10:45,1.0,16,16
2,Y,C_ID_4e6213e9bc,88,N,0,A,80,M_ID_979ed661fc,-6,-0.720386,2017-08-09 22:04:29,1.0,16,37
3,Y,C_ID_4e6213e9bc,88,N,0,A,560,M_ID_e6d5ae8ea6,-5,-0.735352,2017-09-02 10:06:26,1.0,16,34
4,Y,C_ID_4e6213e9bc,88,N,0,A,80,M_ID_e020e9b302,-11,-0.722865,2017-03-10 01:14:19,1.0,16,37

In [9]:
historical_transactions.shape

(29112361, 14)

In [6]:
merchants=pd.read_table( os.path.join('merchants.csv')  ,sep=',' )

In [7]:
pd.DataFrame.head(merchants)

,merchant_id,merchant_group_id,merchant_category_id,subsector_id,numerical_1,numerical_2,category_1,most_recent_sales_range,most_recent_purchases_range,avg_sales_lag3,...,avg_sales_lag6,avg_purchases_lag6,active_months_lag6,avg_sales_lag12,avg_purchases_lag12,active_months_lag12,category_4,city_id,state_id,category_2
0,M_ID_838061e48c,8353,792,9,-0.057471,-0.057471,N,E,E,-0.40,...,-2.25,18.666667,6,-2.32,13.916667,12,N,242,9,1.0
1,M_ID_9339d880ad,3184,840,20,-0.057471,-0.057471,N,E,E,-0.72,...,-0.74,1.291667,6,-0.57,1.687500,12,N,22,16,1.0
2,M_ID_e726bbae1e,447,690,1,-0.057471,-0.057471,N,E,E,-82.13,...,-82.13,260.000000,2,-82.13,260.000000,2,N,-1,5,5.0
3,M_ID_a70e9c5f81,5026,792,9,-0.057471,-0.057471,Y,E,E,NaN,...,NaN,4.666667,6,NaN,3.833333,12,Y,-1,-1,NaN
4,M_ID_64456c37ce,2228,222,21,-0.057471,-0.057471,Y,E,E,NaN,...,NaN,0.361111,6,NaN,0.347222,12,Y,-1,-1,NaN

In [10]:
merchants.shape

(334696, 22)

# Première regression linéaire pour l'exemple de test

In [21]:
import sklearn

In [22]:
from sklearn.linear_model import LinearRegression

## Préparation des variables

In [27]:
pd.DataFrame.head(train)

,first_active_month,card_id,feature_1,feature_2,feature_3,target
0,2017-06,C_ID_92a2005557,5,2,1,-0.820283
1,2017-01,C_ID_3d0044924f,4,1,0,0.392913
2,2016-08,C_ID_d639edf6cd,2,2,0,0.688056
3,2017-09,C_ID_186d6a6901,4,3,0,0.142495
4,2017-11,C_ID_cdbd2c0db2,1,3,0,-0.159749

In [39]:
pd.DataFrame.head( train[train.columns[2:5]] )

   feature_1  feature_2  feature_3
0          5          2          1
1          4          1          0
2          2          2          0
3          4          3          0
4          1          3          0

In [43]:
pd.DataFrame.head(train.loc[:, 'target'])

0   -0.820283
1    0.392913
2    0.688056
3    0.142495
4   -0.159749
Name: target, dtype: float64

## Go

In [44]:
reg_lin=sklearn.linear_model.LinearRegression().fit(train[train.columns[2:5]] 
                                                    ,train.loc[:, 'target'])

## Benchmark

In [94]:
premiere_soumission=reg_lin.predict(test[test.columns[2:5]])

In [96]:
premiere_soumission=pd.DataFrame(premiere_soumission,columns=['target'])

## Ecriture csv

In [97]:
import csv

In [98]:
pd.DataFrame.head(premiere_soumission )

     target
0 -0.435923
1 -0.398107
2 -0.455989
3 -0.310610
4 -0.455989

In [99]:
premiere_soumission.insert(loc=1,column='card_id', value=test.loc[:, 'card_id'])

In [100]:
pd.DataFrame.head(premiere_soumission )

     target          card_id
0 -0.435923  C_ID_0ab67a22ab
1 -0.398107  C_ID_130fd0cbdd
2 -0.455989  C_ID_b709037bc5
3 -0.310610  C_ID_d27d835a9f
4 -0.455989  C_ID_2b5e3df5c2

In [101]:
premiere_soumission.shape

(123623, 2)

In [103]:
pd.DataFrame.head(premiere_soumission )

     target          card_id
0 -0.435923  C_ID_0ab67a22ab
1 -0.398107  C_ID_130fd0cbdd
2 -0.455989  C_ID_b709037bc5
3 -0.310610  C_ID_d27d835a9f
4 -0.455989  C_ID_2b5e3df5c2

In [105]:
premiere_soumission.to_csv('example.csv', index=False)

# Preprocessing

## train

In [110]:
pd.DataFrame.head(train )

,first_active_month,card_id,feature_1,feature_2,feature_3,target
0,2017-06,C_ID_92a2005557,5,2,1,-0.820283
1,2017-01,C_ID_3d0044924f,4,1,0,0.392913
2,2016-08,C_ID_d639edf6cd,2,2,0,0.688056
3,2017-09,C_ID_186d6a6901,4,3,0,0.142495
4,2017-11,C_ID_cdbd2c0db2,1,3,0,-0.159749

In [109]:
train.dtypes

first_active_month     object
card_id                object
feature_1               int64
feature_2               int64
feature_3               int64
target                float64
dtype: object

In [111]:
train_type={
    'target' : np.float,
    'feature_1' : np.int,
    'feature_2' : np.int,
    'feature_3' : np.int,
}

train=pd.read_table( os.path.join('train.csv')  ,sep=',' ,
                    parse_dates=['first_active_month'],
                    dtype=train_type
                   )

In [112]:
train.dtypes

first_active_month    datetime64[ns]
card_id                       object
feature_1                      int32
feature_2                      int32
feature_3                      int32
target                       float64
dtype: object

In [113]:
pd.DataFrame.head(train )

,first_active_month,card_id,feature_1,feature_2,feature_3,target
0,2017-06-01,C_ID_92a2005557,5,2,1,-0.820283
1,2017-01-01,C_ID_3d0044924f,4,1,0,0.392913
2,2016-08-01,C_ID_d639edf6cd,2,2,0,0.688056
3,2017-09-01,C_ID_186d6a6901,4,3,0,0.142495
4,2017-11-01,C_ID_cdbd2c0db2,1,3,0,-0.159749

In [114]:
train['card_id'] = train['card_id'].astype('category')

In [115]:
train.dtypes

first_active_month    datetime64[ns]
card_id                     category
feature_1                      int32
feature_2                      int32
feature_3                      int32
target                       float64
dtype: object

## test

In [116]:
test=pd.read_table( os.path.join('test.csv')  ,sep=',' ,
                    parse_dates=['first_active_month'],
                    dtype=train_type
                   )

test['card_id'] = test['card_id'].astype('category')

In [117]:
test.dtypes

first_active_month    datetime64[ns]
card_id                     category
feature_1                      int32
feature_2                      int32
feature_3                      int32
dtype: object

##  historical_transactions

In [ ]:
#historical_transactions=pd.read_table( os.path.join('historical_transactions.csv')  ,sep=',' )

In [119]:
historical_transactions.dtypes

authorized_flag          object
card_id                  object
city_id                   int64
category_1               object
installments              int64
category_3               object
merchant_category_id      int64
merchant_id              object
month_lag                 int64
purchase_amount         float64
purchase_date            object
category_2              float64
state_id                  int64
subsector_id              int64
dtype: object

In [118]:
pd.DataFrame.head(historical_transactions)

,authorized_flag,card_id,city_id,category_1,installments,category_3,merchant_category_id,merchant_id,month_lag,purchase_amount,purchase_date,category_2,state_id,subsector_id
0,Y,C_ID_4e6213e9bc,88,N,0,A,80,M_ID_e020e9b302,-8,-0.703331,2017-06-25 15:33:07,1.0,16,37
1,Y,C_ID_4e6213e9bc,88,N,0,A,367,M_ID_86ec983688,-7,-0.733128,2017-07-15 12:10:45,1.0,16,16
2,Y,C_ID_4e6213e9bc,88,N,0,A,80,M_ID_979ed661fc,-6,-0.720386,2017-08-09 22:04:29,1.0,16,37
3,Y,C_ID_4e6213e9bc,88,N,0,A,560,M_ID_e6d5ae8ea6,-5,-0.735352,2017-09-02 10:06:26,1.0,16,34
4,Y,C_ID_4e6213e9bc,88,N,0,A,80,M_ID_e020e9b302,-11,-0.722865,2017-03-10 01:14:19,1.0,16,37

In [121]:
historical_transactions['installments'].unique()

array([  0,   1,   5,   3,   4,   2,  -1,  10,   6,  12,   8,   7,   9,
        11, 999], dtype=int64)

In [ ]:
historical_transactions_type={
    'target' : np.float,
    'month_lag' : np.int,
    'feature_2' : np.int,
    'feature_3' : np.int,
}

historical_transactions=pd.read_table( os.path.join('historical_transactions.csv')  ,sep=',' ,
                    parse_dates=['purchase_date'],
                    dtype=historical_transactions_type
                   )

# Première exploration de données